do a = 0 to 3
    pull b
    say b - a
end

if a < b + 7
then do 
    say 666
end
else do
    say 777
end

if (a < b | \ (b < c)) & \ (c < 6) then
do
   say 7
end
